Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །བདག་གི་གནས་སུ་འགྲོ་བར་འདོད་ན་དེར་ཡང་འགྲོ་བར་མ་ནུས་ཏེ།
en: But even though he tried to go home, he could not.

source: །རབ་ཏུ་སྐྲག་ཅིང་ངུས་ནས་འདི་སྙམ་དུ་སེམས་སོ།
en: Frightened still more, he could only weep. He thought, “I am deprived of my magical power completely. Woe is me!

source: །བདག་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཟད་དེ་བདག་དགེ་སྦྱོང་གཽ་ཏ་མ་འདིའི་དབང་དུ་སོང་དུ་འོང་།
en: May I not fall under the control of the monk Gautama!

source: དགྲ་འདིའི་མདུན་དུ་བདག་གི་སྲོག་ཟད་པར་འགྱུར་དུ་འོང་གིས་འདིར་མི་སྣང་བར་བྱས་ཏེ།
en: And may I now disappear, so that I do not die in front of him, my enemy.

source: ཅི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ན་གནས་པའི་སེམས་ཅན་གཅིག་གིས་ཀྱང་བདག་འཆི་བའི་དུས་བྱེད་པ་མི་མཐོང་བར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ཀྱི་ཕ་རོལ་དུ་འཆི་བའི་དུས་བྱའོ་སྙམ་ན།
en: As no being should see me die in his buddha field, may I die as soon as I am out of the Sahā world buddha field.”

source: འོན་ཀྱང་མི་སྣང་བར་བྱ་བའམ། ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་འབྲོས་ཀྱང་མ་ནུས་ཏེ།
en: But still, he was unable to disappear from sight or flee in any direction, cardinal or intermediate.

source: དེ་ཉིད་དུ་མགུལ་པ་བཅིང་བ་ལྔས་བཅིངས་པར་བདག་གིས་མཐོང་ནས་རབ་ཏུ་ཁྲོས་ཤིང་སྐྲག་སྟེ།
en: Instead, he perceived himself, still at the same location, tied around the neck with a fivefold noose, and became even more upset and frightened.

source: སྐད་ཆེན་པོར་ངུ་ཞིང་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Howling in a raucous voice, he lamented, “Woe is me!

source: །ཀྱི་ཧུད་བུ་དང་གཉེན་བཤེས་སྡུག་པ་ཁྱེད་རྣམས་ཕྱིས་མི་མཐོང་ངོ་ཞེས་ཟེར་རོ།
en: I will never again see my dear sons or kinsmen.”

source: །དེ་ནས་བདུད་དབྱངས་དང་ལྡན་པ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བའི་ཆ་བྱད་དུ་འདུག་པར་གྱུར་ཏེ། དེས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Then the māra by the name Ghoṣavati, seated in the manner of a universal monarch, asked Māra , the evil one:

source: །ཅི་ཕྱིར་ཁྱོད་དེང་མྱ་ངན་ཡིད་ཀྱིས་ངུ་གདངས་སྒྲ་ཆེན་འབོད།
en: “Sir, why are you today, in your anguish, loudly lamenting and crying?

source: །འགྲོ་བ་ཀུན་གཙོ་ཐུབ་མཆོག་སྐྱབས་སུ་མ་འཇིགས་མྱུར་དུ་སོང་།
en: Discarding fear, you should promptly go to the exalted sage, the best in the entire world, for refuge.

source: །འཇིག་རྟེན་རྣམས་ཀྱི་མགོན་སྐྱབས་དཔུང་གཉེན་སྡུག་བསྔལ་གསུམ་སེལ་བ།
en: He is the protector, refuge, and defender of the world, who removes the three sufferings.

source: །འདི་ལ་བསྙེན་བཀུར་ཞི་འགྲོ་བ་དེ་བ་ཐོབ་པར་འགྱུར་ཡང་དག །དེ་ནས་བདུད་སྡིག་ཅན་འདི་སྙམ་དུ་བདག་གི་ཚིག་སྙན་པས་དགེ་སྦྱོང་གཽ་ཏ་མ་ལ་སྐྱབས་སུ་སོང་ལ།
en: Surely, if you devote yourself to him, you will obtain peace and happiness.”

source: བཅིངས་པ་འདི་ལས་བདག་གྲོལ་བར་བྱའོ་སྙམ་དུ་བསམས་ཏེ། དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ཕྱོགས་གང་ན་བཅོམ་ལྡན་འདས་བཞུགས་པ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Māra , the evil one, then thought, “If I approach the monk Gautama, with pleasing words, to take refuge, I would then be freed from these fetters.”

source: །གང་ཟག་གི་མཆོག་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་ལས་རབ་ཏུ་ཐར་བར་མཛད་པ་དེ་ལ་ཕྱག་འཚལ་ལོ།
en: Bowing with folded hands toward the Blessed One, he said, “Homage to you, the most eminent person and the ultimate deliverer from birth, aging, disease, and death!

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་ལ་བདག་སྐྱབས་སུ་མཆིའོ།
en: I herewith go to the Blessed Buddha to take refuge.”

source: །འདི་སྐད་ཅེས་ཀྱང་གསོལ་ཏོ།
en: Then he continued:

source: །ཐུབ་མཆོག་མྱུར་དུ་འཇིགས་ཆེན་མི་བཟད་བཅིངས་པ་འདི་ལས་ཁྲོལ།
en: “Release me from this unbearable, terrifying noose, O sage and protector!

source: །དེ་རིང་སླན་ཆད་བདེ་གཤེགས་གཙོ་མཆོག་སྐྱབས་སུ་བདག་མཆིས་ཏེ།
en: Today and henceforth, I take refuge with the Blissful One, the greatest and most important being.

source: །གཏི་མུག་གིས་ནི་བདག་ལྡོངས་ཁྱོད་ལ་ཁྲོས་ཤིང་ནོངས་ཆེན་གྱིས།
en: Having committed grave offenses against you when I was angry and blinded by my ignorance,

source: །མངོན་སུམ་ཁྱོད་བཞག་སྤྱན་སྔར་དེ་དག་སོ་སོར་བཤགས་པར་བགྱི།
en: I confess all of them before you, taking you as my witness.”

source: །གང་གི་ཚེ་བདུད་སྡིག་ཅན་གྱིས་ཚིག་སྙན་པས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་སོང་བ་དེའི་ཚེ་ན་བདག་གྲོལ་བ་སྙམ་དུ་ཤེས་སོ།
en: When Māra , the evil one, thus took refuge in the Blessed Buddha, saying pleasant words, he had the sense that he was released.

source: །ཡང་གང་གི་ཚེ་འཁོར་འདི་ནས་བདག་འགྲོའོ་སྙམ་དུ་བསམས་པ་དེའི་ཚེ་ཡང་མགུལ་པ་བཅིང་བ་ལྔས་བཅིངས་པར་བདག་གིས་ཤེས་ཏེ། གང་གི་ཚེ་གང་དུའང་འགྲོ་བར་མ་ནུས་པ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ལ་མགོན་དང་། སྐྱབས་སུ་སེམས་བསྐྱེད་ནས་ཡང་བདག་ཉིད་གྲོལ་བར་ཤེས་སོ།
en: But when he had the thought to escape from the assembly, he had the sense that his neck was once again bound by a fivefold noose. When he was again unable to go anywhere and thought, once again, of seeking refuge and protection from the Blessed One, he had the sense that he was released.

source: །ལན་བདུན་གྱི་བར་དུ་བདག་བཅིངས་པ་དང་གྲོལ་བར་ཤེས་ཏེ་དེ་ཉིད་དུ་འདུག་གོ།
en: Staying right in that spot, he had the sense of being bound and released seven times over.

source: །འདུས་པ་ཆེན་པོ་རིན་པོ་ཆེ་ཏོག་གི་གཟུངས་ལས། བདུད་བཏུལ་བའི་ལེའུ་ཞེས་བྱ་སྟེ་གསུམ་པའོ།།
en: This concludes the chapter on the taming of Māra , the third in the “ Ratnaketu Sūtra ” from the Great Collection.

source: །།བམ་པོ་བཞི་པ།
en: Chapter

source: གོང་དུ་སྨོས་པའི་བར་དུ་སྟེ། ཉན་ཐོས་ཆེན་པོ་བཞི་པོ་དེ་དག་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་སོང་བ་བདུད་གཞོན་ནུ་དེ་དག་གིས་དགེ་སྦྱོང་གླུ་ལོང་ཤིག །དགེ་སྦྱོང་གར་བྱོས་ཤིག་ཅེས་སྤྱོད་པ་མ་ཡིན་པ་བྱེད་དུ་བཅུག་ནས།
en: When the four great hearers were, as described before, in the great city of Rājagṛha collecting alms, they were rudely accosted by the māra youths who urged them, “Dance, monk!

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཀྱང་སྲང་གི་དབུས་ན་རྒྱུག་ཅིང་མྱ་ངན་ལས་འདས་པའི་ལམ་གྱི་ཚིག་དང་ལྡན་པའི་གླུའི་དབྱངས་ཀྱིས་གང་གི་ཚེ་ཚིགས་སུ་བཅད་པ་སྨྲས་པ་དེའི་ཚེ་ས་ཆེན་པོ་འདི་རབ་ཏུ་གཡོས་སོ།
en: Sing, monk!” When, subsequently, the great hearers, running along the street, sang their verses with lyrics that describe the path to nirvāṇa, this great earth trembled.

source: །སྐད་ཅིག་དེ་ཉིད་ལ་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་བརྒྱ་སྟོང་མང་པོ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྣམས་གདོང་མཆི་མ་ཅན་གྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: At that moment many hundreds of thousands of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, inspired with faith in the Blessed One’s instructions, said this, their faces awash with tears:

source: །ཆོས་ཀྱི་ཁ་ལོ་བསྒྱུར་མཆོག་མྱ་ངན་མེད་བཞུགས་ཀྱང་།
en: “Though the excellent Dharma-leader abides in the state without sorrow,

source: །རྒྱལ་བའི་བསྟན་པ་འདི་ལྟ་བུ་ཡི་གནས་གྱུར་ཏེ།
en: The fine teachings of the victorious ones are in desperate straits.

source: །ཉན་ཐོས་དེ་དག་ལ་ནི་ཀྱལ་ཀ་དེང་བྱས་པ།
en: If beings now see this nonsense directed at his disciples,

source: །འགྲོ་བ་རྣམས་ཀྱིས་མཐོང་ན་དད་པར་ག་ལ་འགྱུར།
en: How will they come to have faith?”

source: །དེ་ནས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། སྲིན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོ་གདོང་མཆི་མ་ཅན་གྱིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལྷགས་ཏེ།
en: Then, many hundreds of thousands of millions of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and rākṣasas, their faces bathed in tears, approached the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Standing before him, they said: “Please consider, O Blessed One,

source: །ད་ལྟར་བསྟན་པ་འདི་ཡི་གནས།
en: The predicament of your instructions at this moment.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀུན་གཟིགས་ཏེ།
en: Do not neglect, O omniscient one,

source: །བསྟན་པའི་ཆོ་ག་བསྲུང་སླད་དུ།
en: The preservation of the practice thereof.”

source: །ཀུན་མཁྱེན་བཏང་སྙོམས་མ་མཛད་ཅིག །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied:

source: འདི་ལྟར་ང་ཉིད་དེར་སོང་སྟེ།
en: “If so, I will go there myself,

source: །བཞོན་དཔུང་བཅས་པའི་བདུད་བཏུལ་ལ།
en: And, having defeated Māra and his mounted forces,

source: །སྐྱེ་བོ་མང་པོ་ཐམས་ཅད་ཀྱང་།
en: I will put the whole of humanity

source: །མྱ་ངན་འདས་གྲོང་འགྲོ་བར་བྱ།
en: On the road to the city of nirvāṇa.”

source: །དེ་ནས་བདུད་དེ་དག་ཐམས་ཅད་ཀྱིས་མགྲིན་གཅིག་ཏུ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་མ་གཤེགས་ཅིག །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ།
en: All those gathered there pleaded with one voice, “Do not go, O Blessed One!

source: བདུད་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ། ཀླུའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ། ལས་རྣམས་ཀྱི་ལས་ཀྱི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པོ་ཞེས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་མ་སྩལ་ཏམ།
en: Have you not said before that the domains of the blessed buddhas, the māras, and the nāgas, and of the acts they commit, are inconceivable?

source: ཡུལ་ཐམས་ཅད་ཀྱི་ནང་ན་ནི་སངས་རྒྱས་ཀྱི་ཡུལ་ཁྱད་པར་དུ་འཕགས་པའི་མཆོག་ལགས་ཏེ།
en: Among all these domains, that of the buddhas is preeminent.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གདན་འདི་ལ་བཞུགས་བཞིན་དུ་བདུད་བྱེ་བ་ཁྲག་ཁྲིག་རབ་ཏུ་ཕམ་པར་མཛད་པ་དང་། ཆོས་ཀྱི་ཕུང་པོ་བྱེ་བ་ཁྲག་ཁྲིག་རབ་ཏུ་བསྟན་པ་དང་། ཉོན་མོངས་པའི་རྒྱ་མཚོ་བ་སྐམ་པ་དང་། ལྟ་བའི་རྒྱ་མོ་དྲལ་བ་དང་། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་ཡེ་ཤེས་ཀྱི་རྒྱ་མཚོ་ལ་གཟུད་པར་སྤྱོད་མོད་ཀྱི།
en: The Blessed One can, while sitting right on his seat, defeat tens of millions of māras, explain tens of millions of Dharma treatises, dry up the ocean of afflictions, tear up the net of wrong views, and submerge tens of millions of beings in the ocean of wisdom.

source: འོན་གྱིས་ཀྱང་བཅོམ་ལྡན་འདས་དེང་གི་དུས་ལ་གཤེགས་པའི་མི་རིགས་སོ།
en: The time is not right for the Blessed One to go now.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སེམས་ཅན་གྱི་ཁམས་ན་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བདུད་དུ་གྱུར་ལ། དེ་དག་རེ་རེའི་བདུད་ཀྱི་སྟོབས་དང་། བྱིན་གྱི་རླབས་ཀྱང་སའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་ཇི་སྙེད་པ་དེ་ཙམ་དུ་གྱུར་ཏེ། དེ་དག་ཐམས་ཅད་ང་ལ་བསད་པར་ཤོམ་ཡང་སྤུའི་ཁུང་བུ་གཅིག་ཙམ་ལ་ཡང་གནོད་པར་མི་ནུས་སོ།
en: The Blessed One replied, “Even if all beings, however many there are in the inhabited realms, were to become māras, and if all the particles of dust, however many there are on earth , were individually mobilized by his power to advance toward me in order to take my life, they would not be able to harm even a single hair on my body.

source: །ངས་འདི་ན་འདུག་བཞིན་དུ་བདུད་བྱེ་བ་ཁྲག་ཁྲིག་རྣམས་རབ་ཏུ་ཕམ་པར་བྱ་བ་དང་། གདུལ་བར་ནུས་ཏེ། བདུད་གཡོག་དང་བཅས་པ་འདི་ནི་མ་གཏོགས་སོ།
en: Whereas I, sitting on this very seat, would be able to defeat tens of millions of billions of māras, except for Māra himself along with his personal retinue.

source: །ཡང་ང་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་བདུད་འདི་དག་གིས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ཐམས་ཅད་བདུད་ཀྱི་སྟོབས་དང་། རྫུ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པའི་བྱིན་གྱི་རླབས་ཀྱི་བཀོད་པས་བརྒྱན་པས།
en: “I will go back so that the entire great city of Rājagṛha becomes adorned by the māras offering worship to me with marvelous displays magically created by the power of Māra.

source: དེ་དག་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་འགྲོ་བར་བྱ་སྟེ་ཡོངས་སུ་སྤྱོད་དོ། །དེ་ནས་བདུད་དེ་དག་རབ་ཏུ་དགའ་ཞིང་དད་པ་སྐྱེས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་དགེ་བའི་ས་བོན་སྐྱེད་པར་འགྱུར་རོ།
en: I will use this event to inspire them with compassion, so that these māras, when supreme appreciation and faith are born in them, will create the roots of virtue necessary to realize unsurpassed and perfect awakening.”

source: །ཇི་ཙམ་ན་གདན་ལས་བཞེངས་པར་བཞེད་པ་དང་། དེ་ནས་འོད་མའི་ཚལ་བསྲུང་བའི་ལྷ་མོ་མཐུ་མཛེས་ཞེས་བྱ་བ་དེས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་གདོང་མཆི་མ་ཅན་དུ་འདུག་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When the Blessed One was thus about to get up from his seat, Prabhāvaśobhanā, the guardian deity of Veṇuvana, stood in front of him with a tearful face and insisted:

source: །བཅོམ་ལྡན་དེ་རིང་གཤེགས་པའི་དུས་མ་ལགས།
en: “This is not the right time, O Blessed One, to enter

source: །གྲོང་ཁྱེར་འདི་དག་ཀུན་ནས་བདུད་ཀྱིས་བལྟམ།
en: The city that is presently crawling with māras.

source: །རེ་རེ་ལ་ཡང་ཤིན་ཏུ་མ་རུངས་པ།
en: Each one of them is exceedingly fierce

source: །བྱེ་བས་སྨྲ་བའི་སེང་གེ་བསྐོར་ཅིང་མཆིས།
en: And surrounded by ten million others, O leonine teacher!

source: །ཞེ་སྡང་རབ་འབར་རྣོ་བའི་མཚོན་ཐོགས་ཏེ།
en: “Wild with anger, they brandish sharp weapons.

source: །ཁྱོད་དགྲོངས་སླད་དུ་འཁྲུགས་པའི་སེམས་ཀྱིས་གནས།
en: They bide their time, their disturbed minds bent on killing you.

source: །མགོན་པོ་རྣམ་པ་ཀུན་ཏུ་དེང་མ་གཤེགས།
en: You should not enter the city under any circumstances, O lord,

source: །འཇིག་རྟེན་རྩ་ལག་བརླག་པར་མ་བཞུད་ཅིག །གང་གི་ཚེ་བཅོམ་ལྡན་འདས་གདན་ལས་བཞེངས་པ་དེའི་ཚེ།
en: Lest you meet your own destruction, O kinsman of the world!”

source: གཙུག་ལག་ཁང་གི་ལྷ་མོ་སྣང་བའི་བློ་གྲོས་ཞེས་བྱ་བ་དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When the Blessed One did, nevertheless, get up from his seat, the goddess of the monastery, Dyutimati, bowed her head to his feet and said:

source: །སྡིག་ཅན་དག་ནི་ལྔ་སྟོང་པོ།
en: “Five thousand evil ones

source: །མཚོན་ཆར་བཅས་པ་མཆིས་པ་ནི།
en: Are waiting with their weapons.

source: །བསམ་མེད་དེ་དག་ཁྱོད་ལ་སྡོ།
en: These cruel māras are expecting you;

source: །ཐུབ་ཆེན་དེ་རིང་མ་གཤེགས་ཤིག །གང་གི་ཚེ་བཅོམ་ལྡན་འདས་གཙུག་ལག་ཁང་ནས་བྱུང་བ་དེའི་ཚེ།
en: You should not go today, O great sage!”

source: སྨན་གྱི་ལྷ་མོ་གྲུབ་པའི་བློ་གྲོས་ཞེས་བྱ་བ་དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When the Blessed One did, nevertheless, walk out of the monastery, the medicine goddess, Siddhimati, bowed her head to his feet and said:

source: །འཇིག་རྟེན་སྒྲོན་མ་བརླག་གྱུར་ན།
en: “If the lamp of the world perishes,

source: །ཀྱི་ཧུད་ཆོས་ཀྱི་ལམ་སྟོར་ཅིང་།
en: Alas, the path will be lost,

source: །ཆོས་ཀྱི་ཚུལ་ནི་རབ་ཏུ་འཇིག །ཆོས་ཀྱི་གྲུ་ཡང་འཇིག་པར་འགྱུར།
en: The Dharma methods will be destroyed, And the ship of Dharma will sink.

source: འཇིག་རྟེན་ཀུན་ན་རྒྱ་ཆེན་ཆོས་ཀྱི་རོ་ནི་ཉམས་པར་འགྱུར།
en: “The exalted essence of the Dharma is waning in the entire world,

source: །འགྲོ་བ་འདི་དག་ཉོན་མོངས་གཡོ་ཅན་གདུག་པས་ཤིན་ཏུ་བལྟམ།
en: Which is overflowing with the fierce and vile afflictions.

source: །ས་འདི་བདེ་གཤེགས་ཐུབ་པའི་མཆོག་ནི་མ་རུངས་འགྱུར་བ་ལས།
en: I have some power over the earth and the power

source: །ཇི་ལྟར་ཤིན་ཏུ་འབྱུང་བའི་མཐུ་ནི་བདག་ལ་ཅི་མ་མཆིས།
en: To prevent the destruction of the Blissful One, the best of sages.

source: །ཁྱོད་བརླག་བགྱི་སླད་འདི་ན་རབ་ཏུ་མི་བཟད་མང་པོ་དག །སྡིག་པའི་ཆོས་ཅན་རལ་གྲི་སྟ་རེ་མཚོན་རྣོན་ཐོགས་ཤིང་མཆིས།
en: “There are many violent beings in this place intent on killing you. Dedicated to evil ways, they are waiting with their sharp axes and swords.

source: །བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་བསྲུང་སླད་བདག་གི་ཚིག་གསོན་ཏེ།
en: Please heed my plea, O Blissful One, on how to protect the world.

source: །སྟོབས་བཅུ་གྲུབ་པར་བཞུད་དེ་དེ་རིང་གྲོང་ཁྱེར་མ་གཤེགས་ཤིག །དེ་ནས་བཅོམ་ལྡན་འདས་གཙུག་ལག་ཁང་གི་དངར་ནས་བཞུད་པ་དང་། དེ་ན་ཤིང་གི་ལྷ་མོ་འོད་འཆང་ཞེས་བྱ་བ་དེ་སྙིང་རྗེ་སྙིང་བརྩེ་བར་ངུ་ཞིང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Do not enter the city, O mountain with the ten strengths who has accomplished his journey!” But the Blessed One set forth from the monastery courtyard. The tree goddess Dyutindharā, wailing most piteously, bowed her head to his feet and pleaded: “Lord!

source: །ཐམས་ཅད་དོན་གྲུབ་ཐུབ་པ་ཡིད་བཞིན་རྫོགས་ཁྱོད་མ་རུངས་གྱུར་ན་ནི།
en: The moment that you—the sage who fulfills all wishes and accomplishes all aims—

source: །མགོན་པོ་ཁམས་གསུམ་འདི་དག་ཐམས་ཅད་དེའུ་རེ་མིག་ནི་སྟོར་བར་འགྱུར།
en: Have perished, the entire threefold universe will be deprived of its eyesight.

source: །ནམ་མཁའ་འདི་ལ་སྦྲུལ་གྱི་རྐེད་ཆིངས་རྣོ་བའི་མདའ་དང་མཚོན་ཐོགས་ཤིང་།
en: Warriors with snake-like tongues and flaming mouths, armed with sharp swords and arrows, Roam the sky above, intent on killing you.

source: །ཁྱོད་དགྲོངས་སླད་དུ་ཁ་ནས་མེ་འབར་རྒྱུ་ཡིས་ད་ནི་དེར་མ་གཤེགས།
en: Do not go there now!”

source: །དེ་ནས་སྒོ་ཁང་གི་ལྷ་མོ་འོད་ཟེར་ཆུའི་ལྷ་ཞེས་བྱ་བ་དེ་སྒྲ་ཆེར་ངུ་ཞིང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: When the Blessed One approached the covered gate passage, the goddess thereof, Jyotivaruṇā by name, wailing in a loud voice, bowed her head to his feet and said:

source: །གྲོང་ཁྱེར་བཟང་པོ་འདི་ན་བྲམ་ཟེར་མིང་བཏགས་སྟོང་ཕྲག་ཉི་ཤུ་པོ།
en: “In that fine city, there are twenty thousand so-called brahmins.

source: །མདའ་དང་སྤུ་གྲི་མཚོན་ཆ་འབར་བ་ཐོགས་ཏེ་སྙིང་རྗེ་མེད་པར་བལྟ།
en: They are looking for you, armed with flaming swords, knives, and arrows, and devoid of mercy.

source: །གཅིག་པས་གཅིག་མི་བཟད་པ་སྙིང་རྗེ་མེད་པ་སྟོང་ཕྲག་ཉི་ཤུ་རྣམས།
en: Twenty thousand of them, pitiless and cruel even to one another,

source: །ཁྱོད་དགྲོངས་སླད་དུ་འདི་ན་མཆིས་ཀྱིས་གཙང་མའི་ཞལ་ནི་མ་གཤེགས་ཤིག །དེ་ནས་བཅོམ་ལྡན་འདས་སྒོ་ཁང་དུ་བྱོན་པ་དང་། དེར་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་བསྲུང་བའི་ལྷ་མོ་ཏ་མ་ལའི་སྙིང་པོ་ཞེས་བྱ་བ་དེ་ནམ་མཁའ་ལས་སྒྲ་ཆེར་ངུ་ཞིང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་རིངས་པར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Are waiting not far from here to kill you. Please, do not go, O fair-faced one!” When the Blessed One nevertheless entered the gate passage, the protector goddess of the city of Rājagṛha, Tamālasārā by name, crying out from the sky in a loud voice, hastily approached him, bowed her head to his feet, and warned:

source: །བཅོམ་ལྡན་ཤུལ་འདི་སེང་གེ་རྔ་མོ་གླང་ཆེན་སྨྱོན་པས་བསྐོར།
en: “What is more, O Blessed One, the road from here is overrun with lions, camels, and rutting elephants.

source: །དགེ་སློང་རྣམས་ལ་གཙེ་སླད་བདུད་ཀྱི་རྣམ་མང་གནོད་པར་བགྱིད།
en: The māras have set up ambushes to endanger the monks.

source: །ས་འདིར་སྟོན་པ་ཁྱོད་དགྲོངས་སླད་དུ་མུ་སྟེགས་གཞན་ཡང་བརྩོན།
en: Also, the followers of other religions are poised to eliminate you, the Teacher, from this earth

source: །སྤྲིན་དབྱངས་འོད་འབར་ལྷ་ཀླུ་ཐུགས་བརྩེའི་སླད་དུ་མ་གཤེགས་ཤིག །བཅོམ་ལྡན་བདུད་བཏུལ་ཁྱོད་ཀྱིས་བསྟན་པ་རྣམ་ཞིག་དང་། །སྒྱུ་མ་བགྱིས་པ་མི་འཐུན་གདོང་ཅན་བདུད་མཐོང་ནས།
en: Out of compassion for the gods and the nāgas, please don’t go, O lighted lamp with a thunderous voice! “O blessed tamer of māras!

source: །ལྷ་མི་ཀླུ་དང་མི་འམ་ཅི་ཡི་དབང་པོ་རྣམས།
en: The lords of humans, gods, serpentine beings, and kinnaras,

source: །ཀུན་འདུས་མི་དགའ་སྐྲག་ནས་ཤིན་ཏུ་རྣམ་པར་འཁྲུགས།
en: Disturbed by the possible destruction of your doctrine, have joined together. Frightened, they chase the māras, And also the magically created figures with grotesquely disfigured faces.

source: །དམ་ཆོས་ཆེར་ཞིག་པ་དང་འཇིག་རྟེན་འཁྲུགས་གྱུར་དང་། །ནམ་མཁའ་སྐར་མའི་འོད་སྟོར་ཉི་ཟླ་གྱུར་མཐོང་ནས།
en: “Seeing the impending demise of the sacred Dharma, the calamities befalling the world, The sky with the light of the constellations all gone, and the unsteadiness of the sun and the moon,

source: །འགྲོ་མཆོག་ཀྱེ་མ་མི་བཟད་ཀླད་པ་དེང་དྲག་རྡོབ།
en: Virtuous people cannot bear it; beating their heads,

source: །བདེ་གཤེགས་མ་རུང་འགྱུར་བར་ཀུན་དོགས་ཀྱི་ཧུད་མཆི།
en: Dreading that the Blissful One may perish, they can only exclaim, ‘Alas! Woe is us!’

source: །མཐོང་བའི་ཉི་མ་འདི་ཉམས་ཤིང་།
en: “The sun of the doctrine is setting.

source: །ཆོས་ཀྱི་སྒྲོན་མ་ཟད་པར་འགྱུར།
en: The meteor of the Dharma is fading out.

source: །རྫོགས་པའི་སངས་རྒྱས་གྲོངས་པས་བརླག །ཆོས་ཀྱི་ཆུ་ཡང་སྐམ་པར་འགྱུར།
en: Death is trampling down upon the perfect Buddha. The water of the Dharma is drying up. “When the ruin of the followers

source: །དམ་ཆོས་སྤྱོད་པ་འཇིག་རྟེན་དུ།
en: Of the sacred Dharma has approached,

source: །མ་རུང་འགྱུར་བ་ཉེར་གནས་ཚེ།
en: There will be, in this world,

source: །མི་དགེ་བ་ཡི་བདུད་རྣམས་ཀྱང་།
en: A proliferation of nonvirtuous māras.”

source: །འདི་དག་ཏུ་ནི་འབྱུང་བར་འགྱུར། །དེ་ནས་ལྷ་མོ་དེས་བཅོམ་ལྡན་འདས་ཕྱིར་ལྡོག་པར་མ་མཐོང་ནས་གདོང་མཆི་མ་ཅན་གྱིས་ཡང་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Seeing that the Blessed One would not turn back, the goddess shed even more tears and begged:

source: །ཐུབ་པ་འཇིག་རྟེན་ཀུན་ལ་གཟིགས་སུ་གསོལ།
en: “Please have regard, O sage, for this entire world!

source: །སྨྲ་མཆོག་དེ་རིང་བརླག་པར་མ་བཞུད་ཅིག །བདག་གི་གྲོང་དུ་མ་རུང་ཁྱོད་གྱུར་ན།
en: Do not go, O best of speakers, to your destruction today! If you meet your doom in my city,

source: །འཇིག་རྟེན་གསུམ་གྱིས་རྟག་སྨད་འགྱུར་དུ་མཆི།
en: I would be forever blamed by the threefold universe.

source: །འདྲེན་པ་བདག་གི་ཚིག་གསོན་སེམས་ཅན་མཆོག །བདག་གི་གྲོང་དུ་བརླག་པར་དེང་མ་བཞུད།
en: “Heed my plea, O Guide, the best of beings! Do not go to destruction in my city today,

source: །སེམས་ཅན་ཐུགས་བརྩེའི་སླད་དུ་འདིར་གཞེས་ཏེ།
en: But, out of compassion for beings, wait here,

source: །སེམས་ཅན་སྐྱེ་བས་གཙེས་པ་འཇིགས་ཐར་མཛོད། །དམ་པ་བརྙེས་ནས་སྒྲོལ་བར་རབ་འགྱུར་བར།
en: Liberating them from the fear and pain of rebirth!

source: །སྔོན་གྱི་དམ་བཅས་དེ་བཞིན་གཤེགས་པས་དགོངས།
en: “Remember your former pledge, O Thus-Gone One— ‘When I attain the ultimate state, may I become a savior

source: །སེམས་ཅན་མང་པོ་སྡུག་བསྔལ་དུ་མས་གདུངས།
en: Of the many beings afflicted by great suffering!’

source: །སྲོག་ཆགས་རྣམས་ཀྱི་གཙོ་བོ་དབུགས་ཕྱུང་ཤི །སྐུ་མཆོག་བསྐལ་པ་བྱེ་བ་མང་པོར་བཞུགས།
en: Give comfort, O supreme being, to all those who draw breath. “Remain, O best of embodied beings, for many millions of eons!

source: །ཀྱེ་མ་འདོད་ལ་ཆགས་པའི་བྱིས་པའི་སྡེ།
en: The naive are caught up in sense objects.

source: །དེ་རྣམས་ཞི་བགྱིད་སླད་དུ་ཆོས་ལམ་ཤོད།
en: To give them peace, please show them the Dharma path leading to

source: །སྐྱེ་མཆེད་དབང་པོ་དོན་ནི་རང་བཞིན་སྟོང་།
en: The realization that the sense bases and faculties are empty by nature!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་སྒོ་ཁང་དུ་གཤེགས་པ་དང་། དེ་ནས་སའི་ལྷ་མོ་གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བའི་ལྷ་མོ་ཁྲི་དང་ལྷན་ཅིག་སྐྲ་བཤིག་ཅིང་གདོང་མཆི་མ་ཅན་གྱིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཐལ་མོ་སྦྱར་ཏེ་འདུག་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: But the Blessed One advanced farther along the gate passage. The earth goddess, Dṛḍhā, together with ten thousand other deities each endowed with great vigor, her face bathed in tears and hair disheveled, stood before the Blessed One with folded hands and pleaded:

source: །རབ་ཏུ་སྦྱིན་ལ་དགོངས་ཤིང་ཁྱོད་ཀྱིས་ནི།
en: “Remember the gifts that you made in the past—

source: །རྒྱ་མཚོ་བཞིན་བལྟམ་པ་ཡི་ཁྲག་བསྩལ་ཅིང་།
en: Your blood that would fill the four oceans;

source: །དབུ་དང་རུས་པ་ཁོར་ཡུག་རི་རབ་ཙམ།
en: Your head and bones, enough to form the Cakravāḍa range;

source: །སྤྱན་ཡང་གང་གཱའི་བྱེ་མ་རྙེད་སྩལ་ཏོ།
en: Your eyes, numerous as the grains of sand in the Gaṅgā;

source: །སྔོན་ནི་རིན་ཆེན་རྣམ་པ་སྣ་ཚོགས་དང་། །སྲས་དང་བཙུན་མོ་གླང་ཆེན་དེ་བཞིན་རྟ།
en: “Your various jewels, given away in the past; And your sons, daughters, elephants, horses,

source: །གནས་དང་གོས་དང་མལ་ཆ་ཟས་སྐོམ་དང་། །དེ་བཞིན་ནད་པ་དག་ལ་འདོད་སྨན་བསྩལ།
en: Houses, clothes, beds, food, drink, And medicine needed by the sick.

source: །རང་བྱུང་མཆོག་རབ་ལ་ནི་མཆོད་པ་མཛད།
en: “You offered supreme worship to the self-arisen ones,

source: །ཁྱོད་ཀྱིས་བག་ཡོད་པར་ཡང་ཚུལ་ཁྲིམས་བསྲུངས།
en: Carefully guarded your discipline

source: །བཟོད་པ་དང་ནི་ཐོས་པ་རྟག་ཏུ་བསྙེན།
en: Always applied yourself to forbearance and study,

source: །ཕར་འཛིན་མར་འཛིན་པ་ཡང་དེ་བཞིན་ནོ།
en: And honored your mother and father.

source: །བྱ་བ་དཀའ་བ་དག་ཀྱང་མཐའ་ཡས་སྤྱད།
en: “You practiced endless difficult austerities

source: །སེམས་ཅན་དུ་མ་ཉོན་མོངས་ཐར་བར་མཛད།
en: And freed beings from their many afflictions.

source: །གང་སྔོན་ཁྱོད་ཀྱིས་སྨོན་ལམ་བཏབ་པ་ནི།
en: In the past, at the very start, you made the following vow: ‘May I become a buddha who shows the absolute truth

source: །ལམ་མཆོག་སྟོན་པ་སངས་རྒྱས་ཉིད་གྱུར་ཅིག །ཆུ་བོ་ཆེན་པོ་ལས་ནི་འགྲོ་བ་བསྒྲལ།
en: ‘And saves humanity from the great ocean of suffering!

source: །འཇིག་རྟེན་ལ་ཡང་ཤིན་ཏུ་ཆོས་བསྟན་ཏེ།
en: May I teach the Dharma to the world! May I uproot craving and the great fears!

source: །སྡུག་བསྔལ་མ་ལུས་པར་ནི་བསལ་བར་བྱ།
en: May I dispel all suffering!

source: །སེམས་ཅན་མང་པོ་འཇིགས་མེད་གྲོང་ཁྱེར་གཟུད།
en: “ ‘May I lead multitudes of beings to the city of fearlessness By establishing them on the path to supreme awakening! May I liberate those afflicted with much suffering

source: །སེམས་ཅན་དེ་དག་དགོས་པ་ཡོངས་རྫོགས་ཤིང་། །བྱང་ཆུབ་དམ་པ་ལ་ནི་ཤིན་ཏུ་ཁོད།
en: And fulfill all the needs of beings!’

source: །འདི་ན་ལམ་བོར་སྡིག་པ་སྤྱོད་པ་རྣམས།
en: “Forgive those, O lord, who have strayed from the path

source: །ཚུལ་ཁྲིམས་ཐོས་བཤིག་མགོན་པོས་བཟོད་པར་མཛོད།
en: And commit evil in this world, ruining their learning and discipline

source: །འདི་དག་སྒྲོལ་ཚིག་དམ་བཅས་དགོངས་སུ་གསོལ།
en: Save them! Remember your vow!

source: །བསྐལ་པ་བྱེ་བ་མང་པོར་ཆོས་སྟོན་ཏོ།
en: Continue to teach the Dharma for many millions of eons!
